# Toposolid Set Smoothed Surface Method

Source: https://www.revitapidocs.com/2026/a565b8eb-196a-415d-3826-81b58d1e4018.htm

---

| Toposolid Set Smoothed Surface Method |
| --- |

Sets smoothed surface setting of Toposolid.
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static void SetSmoothedSurface(
	Document document,
	bool enable
)
```

```
Public Shared Sub SetSmoothedSurface (
	document As Document,
	enable As Boolean
)
```

```
public:
static void SetSmoothedSurface(
	Document^ document,
	bool enable
)
```

```
static member SetSmoothedSurface :
        document : Document *
        enable : bool -> unit
```

#### Parameters

document Document
:   The document.

enable Boolean
:   True means enable smoothed surface setting, otherwise disable.

Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non\-optional argument was null |

See Also

#### Reference

Toposolid Class Autodesk.Revit.DB Namespace